<template>
    <div>
        <b-card
            title="Бедные птички😭"
            class="mb-2 text-center"
        >

            <b-card-text class="text-left">
                Бедные птички - это проект, в котором вы с соткой в руках решаете открыть птицеферму! Чтобы купить птиц вы выбираете между разными поставщиками (базар, магазин, частник дядя Коля и др.) и приобретаете у них птиц; они несут вам яйца, продавая которые, вы будете получать прибыль; покупать новых птиц; и получать прибыль еще больше!
                Но птицы тоже не пальцем деланные 🤪 Чтобы они хорошо плодоносили, придется за ними ухаживать:
                убирать помет😅 и просто гладить, чтобы они лучше неслись

                <hr>
                Данная игра еще находится в разработке, так что возможны баги, обнуление результатов.
                В игру все еще добавляется новый контент.
                Планируется добавить:
                <ul>
                    <li>Продажа яиц разным покупателям (Дополнительный бонус к спросу)</li>
                    <li>Мини-блог новостей</li>
                    <li>Донат а игре</li>
                </ul>
            </b-card-text>
            <hr>
            <b-button class="text-center" :to="{name: 'birds'}" variant="primary">Купить пташку!</b-button>
        </b-card>

        <!--    NEWS    -->
        <b-card>
            <h3>Новости</h3>
            <b-card class="p-1 mb-2">
                Добавлены новые птицы: <ul>
                <li>Гусь</li>
                <li>Утка</li>
                <li>Индюк</li>
                <li>Петух</li>
                <li>Генномодифицированный петух</li>
                <li>Петух-трансгендер</li>
                <li>и другие</li>
            </ul></b-card>
            <b-card class="p-1 mb-2">
                В приложение добавлены уведомления
            </b-card>
        </b-card>
    </div>
</template>

<script>
export default {
    name: "Index"
}
</script>

<style scoped>

</style>
