<template>
    <b-card
        title="Бедные птички😭"
        class="mb-2 text-center"
    >

        <b-card-text class="text-left">
            Бедные птички - это проект, в котором вы с соткой в руках решаете открыть птицеферму! Чтобы купить птиц вы выбираете между разными поставщиками (базар, магазин, частник дядя Коля и др.) и приобретаете у них птиц; они несут вам яйца, продавая которые, вы будете получать прибыль; покупать новых птиц; и получать прибыль еще больше!
            Но птицы тоже не пальцем деланные 🤪 Чтобы они хорошо плодоносили, придется за ними ухаживать:
            убирать помет😅 и просто гладить, чтобы они лучше неслись

            <hr>
            Данная игра еще находится в разработке, так что возможны баги, обнуление результатов.
            В игру все еще добавляется новый контент.
            Планируется добавить:
            <ul>
                <li>Кол-во птиц для открытия договора с продавцом</li>
                <li>Отдельная покупка сертификатов</li>
                <li>Разные покупатели</li>
                <li>Донат</li>
            </ul>
        </b-card-text>

        <b-button :to="{name: 'birds'}" variant="primary">Купить пташку!</b-button>

    </b-card>
</template>

<script>
export default {
    name: "Index"
}
</script>

<style scoped>

</style>
