<template>
    <b-card>
        <h2>💰Взятки</h2>
        <h5>Платите Густову, чтобы выжить!</h5>
        <p>
            После того, как вы спаслись от погребения заживо, вы стали бояться каждого шороха.
            А всё потому, что Густов в любой момент может вас снова попытаться убить.
            Поэтому вы решаете дать ему большущую взятку в размере 1.000.000.000 рублей.
        </p>
    </b-card>
</template>

<script>
export default {
    name: "Bribe"
}
</script>

<style scoped>

</style>
