<template>
    <b-card>
        <h2>💰Взятки</h2>
        <h5>Платите Густову, чтобы выжить!</h5>
        <p>
            После того, как вы спаслись от погребения заживо, вы стали бояться каждого шороха.
            А всё потому, что Густов в любой момент может вас снова попытаться убить.
            Поэтому вы решаете дать ему большущую взятку в размере 1.000.000.000 рублей.
        </p>
        <hr>

        <div class="d-flex justify-content-center flex-wrap">
            <div class="col-sm-6 col-8">

                <img class="w-100" src="http://www.procuror.spb.ru/gif/gustov.jpg" alt="ГУСТОВ">

                <div class="d-flex justify-content-center flex-wrap">
                    <b-button class="w-100" variant="danger" @click="repayLoan">💰Отдать все свои деньги💰</b-button>
                    <span class="alert-info p-2 m-2 w-auto text-center">Осталось: {{getBribe}}₽</span>
                </div>
            </div>
        </div>
    </b-card>
</template>

<script>
import {mapActions, mapGetters, mapMutations} from "vuex";

export default {
    name   : "Bribe",
    data   : function (){
        return {rest: this.getBribe};
    },
    computed: {
        ...mapGetters(['getBribe'])
    },
    methods: {
        ...mapActions(['reduceBribe']),
        ...mapMutations(['showModal']),
        async repayLoan() {
            let res = await this.reduceBribe(); // reduce bribe by user balance

            if(!res) return;

            if (this.getBribe >= 5000000) {
                // sound of damage
                let song    = new Audio( '/assets/sounds/death.mp3');
                song.volume = 0.5;
                song.play();
            } else if (this.getBribe <= 0) {
                // sound of dying
                let song    = new Audio('/assets/sounds/groans.mp3');
                song.volume = 0.5;
                song.play();

                song.onended = () => {
                    this.showModal({
                        title: "Густов повержен!",
                        text: '<p>Вы собрали 1 миллиард рублей для взятки святом Густову! 1 МИЛЛИАРД! </p>' +
                            '<p>Вы пришли в мерию с тремя мешками денег, и сразу же встретили Густова. ' +
                            'Он выглядел плохо, он облысел, появились мешки под глазами. Но встретив ' +
                            'вас, он улыбнулся. Он сразу понял, что это деньги, и пригласил вас на чашечку кофе. ' +
                            'Кофе вы пить не стали, так как вас уже пытались им отравить, но вы прошли с ним. ' +
                            'Густов рассказал, что больше на вас не обижается и что с радостью примет ваш подарок. ' +
                            'На самом деле это брат Аркадия Назарянина, Григорий Назарянин, завидовал Аркадию. ' +
                            'Когда вы заплатили Аркадию, он рассказал об этом Грише. Тот очень разозлился на вас обоих. ' +
                            'И взломал моего орла!</p> <p> Было видно, что он не врал. Вы простили густова.. </p>' +
                            '<p>Затем вы спросили, что он хочет сделать с этими деньгами - ' +
                            'он собирается построить новые Густинианские храмы в других городах, чтобы приобщить ' +
                            'неверующих еритеков, а еще отдать часть Григорию, чтобы с вами ничего не случилось</p>' +
                            '<p>Теперь вы полностью свободны и вам ничего не угрожает!</p>' +
                            '<p>После этой встречи Густов стал выглядеть лучше, видимо его мучал ' +
                            'этот инцидент. Вы стали с ним часто встречаться, он стал вашим другом!</p>' +
                            '<br><p style="color: orange">СПАСИБО ЗА ИГРУ!</p>'
                    });
                }
            } else if (this.getBribe < 5000000) {
                // sound of heart beat
                let song    = new Audio('/assets/sounds/heart_beat.mp3');
                song.volume = 0.5;
                song.play();
            }
        }
    }
}
</script>

<style scoped>

</style>
